# #Вариант 27
#
# print("\t Меню")
# print(" 1. Посчитать кол-во четных/нечетных цифр \n 2. Посчитать, сколько пар (стоят рядом) верхнего и нижнего регистра находится в веденном с клавиатуры слове. ")
# print(" 3. Найти произведение элементов списка с нечетными номерами. \n 4. Отсортировать словарь по ключу в порядке возрастания")
# print(" 5. Магазин игрушек \n 6. Кортеж")
#
# a = int(input("\nВыберите значение: "))
# if a = 1:
# elif a = 2:
# elif a = 3:
# elif a = 4:
# elif a = 5:
# else a = 6:


#1.
b = int(input("\nВведите значение: "))
if b % 2 == 0:
    print("Четное")
else:
    print("Нечетное")


